000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBOL-PAI.
000300 AUTHOR. LJFLISP.
000400 DATE-WRITTEN. 2023/1/25.
000500 REMARKS.
000510 Approximates pi            USING ljflisp-pi.
000520 Calculate to 15             decimal places.
000600 PROCEDURE DIVISION.
000700 WORKING-STORAGE SECTION.
000800 01 PI PIC 9(1)V9(20)        value(3).
000900 01 A PIC 9(10) VALUE 2.    
000100 DISPLAY  "PI= "
000100 STOP RUN.